app/Controllers/Api/V1/Users.php

INSERT INTO "users" ("username", "name", "middle_name", "last_name", "password", "email", "role_id", "created_at") VALUES ('fsdffgfsddddfdfdsdsdddd', 'sdfsdf', 'sdfsdsd', 'sdfsdds', '4234223', 'fsddgfgfsdddsfdsdd@gmail.com3', 2, '2024-06-15 02:23:10')
---
    public function create(){

        $request = $this->request->getJSON();

        $data = [
            'username' => $request->username,
            'name' => $request->name,
            'middle_name' => $request->middle_name,
            'last_name' => $request->last_name,
            'password' => $request->password,
            'email' => $request->email,
            'role_id' => 2
        ];

        if(!$this->validateData($data,'user')){
            return $this->fail($this->validator->getErrors(),400);
        }

        $username_existent = $this->model->where('username',$data['username'])->findAll();

        if($username_existent){
            return $this->fail(['message' => "nombre de usuario no disponible."],400);
        }

        $email_existent = $this->model->where('email',$data['email'])->findAll();

        if($email_existent){
            return $this->fail(['message' => "correo ya registrado."],400);
        }

        $result = $this->model->insert($data);